Conf.Simple/src/DataProcessors/SUI_РабочееМестоОператораОбмена/SUI_РабочееМестоОператораОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>SUI_РабочееМестоОператораОбмена</name>
</mdclass:DataProcessor>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/DataProcessors/SUI_РабочееМестоОператораОбмена/Forms/ВыборДокументаДляВыгрузки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НастройкаДокумента") Тогда
		НастройкаДокумента = Параметры.НастройкаДокумента;
	КонецЕсли;
	
	ИнициализироватьСписокВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаДокументаПриИзменении(Элемент)
	ИнициализироватьСписокВыбора();
	ОбновитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(НастройкаДокумента) И Элемент.ТекущиеДанные <> Неопределено Тогда
		Закрыть(Новый Структура("НастройкаДокумента, ДокументСсылка", НастройкаДокумента, Элемент.ТекущиеДанные.Ссылка));
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(НастройкаДокумента) И Элемент.ТекущиеДанные <> Неопределено Тогда
		Закрыть(Новый Структура("НастройкаДокумента, ДокументСсылка", НастройкаДокумента, Элемент.ТекущиеДанные.Ссылка));
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.Список.Доступность = ЗначениеЗаполнено(НастройкаДокумента);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСписокВыбора()
	
	Список.Отбор.Элементы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_НастройкиДокументов.ИмяОбъектаМетаданных,
		|	SUI_НастройкиДокументов.НастройкиСхемыКомпоновкиДанных
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов
		|ГДЕ
		|	SUI_НастройкиДокументов.Ссылка = &Ссылка
		|	И SUI_НастройкиДокументов.Ссылка <> ЗНАЧЕНИЕ(Справочник.SUI_НастройкиДокументов.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", НастройкаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Список.ТекстЗапроса = "ВЫБРАТЬ
		|	NULL КАК Ссылка";
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		НастройкиКД = Выборка.НастройкиСхемыКомпоновкиДанных.Получить();
		
		Если ТипЗнч(НастройкиКД) <> Тип("НастройкиКомпоновкиДанных") Тогда
			НастройкиКД = Новый НастройкиКомпоновкиДанных();
		КонецЕсли;
	
		Список.ТекстЗапроса = "ВЫБРАТЬ * ИЗ Документ." + Выборка.ИмяОбъектаМетаданных + " КАК Документ";
		Список.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКД);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
